## Terraform Plan — ✅ No changes

| Step | Status |
|------|--------|
| Init | `success` |
| Validate | `success` |
| Plan | `success` |

> **Merging this PR will automatically trigger `terraform apply` + Teleport RBAC apply** via the `production` environment gate.

<details><summary>Show Plan Output</summary>

```hcl
tls_private_key.main: Refreshing state... [id=dd60cf26680e890a10ad2d5dbe5dfa27f17f2330]
local_sensitive_file.private_key: Refreshing state... [id=3e9d14196a7814598975a2af9b875c487574f065]
aws_iam_role_policy.rds_iam_auth: Refreshing state... [id=grant-tam-ec2-role:grant-tam-rds-iam-auth-policy]
aws_subnet.secondary: Refreshing state... [id=subnet-06780303b8ba9d883]
aws_iam_role.ssh_node: Refreshing state... [id=grant-tam-ssh-node-role]
aws_key_pair.main: Refreshing state... [id=grant-tam-key]
aws_db_parameter_group.main: Refreshing state... [id=grant-tam-pg17]
aws_vpc.main: Refreshing state... [id=vpc-077a2e9746ba3d35f]
aws_db_subnet_group.main: Refreshing state... [id=grant-tam-db-subnet-group]
aws_security_group.rds: Refreshing state... [id=sg-0e7f881d1bc0dbce3]
aws_db_instance.teleport: Refreshing state... [id=db-MYN2RWSKYW7WYAREFOPNOVFBBQ]
aws_s3_bucket.teleport_sessions: Refreshing state... [id=grant-tam-teleport-sessions]
aws_secretsmanager_secret.teleport_license: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:278576220453:secret:grant-tam/teleport/license-lKTYE9]
data.aws_route53_zone.teleport: Reading...
aws_iam_role.ec2: Refreshing state... [id=grant-tam-ec2-role]
data.aws_ami.ubuntu: Reading...
aws_iam_instance_profile.ssh_node: Refreshing state... [id=grant-tam-ssh-node-profile]
aws_iam_role_policy.ssh_node_teleport: Refreshing state... [id=grant-tam-ssh-node-role:grant-tam-ssh-node-teleport-policy]
aws_secretsmanager_secret_version.teleport_license: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:278576220453:secret:grant-tam/teleport/license-lKTYE9|terraform-20260315003856918600000002]
aws_iam_role_policy.secrets_manager: Refreshing state... [id=grant-tam-ec2-role:grant-tam-secrets-manager-policy]
aws_iam_instance_profile.ec2: Refreshing state... [id=grant-tam-ec2-profile]
data.aws_ami.ubuntu: Read complete after 0s [id=ami-0d76b909de1a0595d]
data.aws_route53_zone.teleport: Read complete after 0s [id=Z013845130G68TTJ5HE4R]
aws_internet_gateway.main: Refreshing state... [id=igw-076ff200c1161a7e0]
aws_subnet.main: Refreshing state... [id=subnet-0546824c86a182aba]
aws_lb_target_group.teleport: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:278576220453:targetgroup/grant-tam-teleport-tg/3a01157b2b0282ac]
aws_security_group.main: Refreshing state... [id=sg-0e4142be9c6b37261]
aws_route_table.main: Refreshing state... [id=rtb-0e4cffea628d6bccd]
aws_lb.teleport: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:278576220453:loadbalancer/net/grant-tam-teleport-nlb/88a2201f66e8d6c7]
aws_instance.node1: Refreshing state... [id=i-09307edec8ec3fc53]
aws_s3_bucket_versioning.teleport_sessions: Refreshing state... [id=grant-tam-teleport-sessions]
aws_instance.ssh_node_1: Refreshing state... [id=i-09f9293b6bc4e509d]
aws_s3_bucket_server_side_encryption_configuration.teleport_sessions: Refreshing state... [id=grant-tam-teleport-sessions]
aws_instance.node2: Refreshing state... [id=i-0baf4b496d856add3]
aws_iam_role_policy.s3_sessions: Refreshing state... [id=grant-tam-ec2-role:grant-tam-s3-sessions-policy]
aws_instance.master: Refreshing state... [id=i-0031b7d347bb0cff4]
aws_s3_bucket_public_access_block.teleport_sessions: Refreshing state... [id=grant-tam-teleport-sessions]
aws_route_table_association.main: Refreshing state... [id=rtbassoc-0bc4bd8a4f900bf2b]
aws_lb_target_group_attachment.node2: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:278576220453:targetgroup/grant-tam-teleport-tg/3a01157b2b0282ac-20260315003909975600000004]
aws_lb_target_group_attachment.master: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:278576220453:targetgroup/grant-tam-teleport-tg/3a01157b2b0282ac-20260315003910381100000006]
aws_lb_target_group_attachment.node1: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:278576220453:targetgroup/grant-tam-teleport-tg/3a01157b2b0282ac-20260315003910299800000005]
aws_route53_record.teleport_wildcard: Refreshing state... [id=Z013845130G68TTJ5HE4R_*.grant-tam-teleport.gvteleport.com_CNAME]
aws_route53_record.teleport: Refreshing state... [id=Z013845130G68TTJ5HE4R_grant-tam-teleport.gvteleport.com_CNAME]
aws_lb_listener.teleport_443: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:278576220453:listener/net/grant-tam-teleport-nlb/88a2201f66e8d6c7/d2652ea4068d7dbd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_db_instance.teleport will be destroyed
  # (because aws_db_instance.teleport is not in configuration)
  - resource "aws_db_instance" "teleport" {
      - address                               = "grant-tam-pg-1.cgi8j6a0fvrt.us-west-2.rds.amazonaws.com" -> null
      - allocated_storage                     = 20 -> null
      - apply_immediately                     = false -> null
      - arn                                   = "arn:aws:rds:us-west-2:278576220453:db:grant-tam-pg-1" -> null
      - auto_minor_version_upgrade            = true -> null
      - availability_zone                     = "us-west-2a" -> null
      - backup_retention_period               = 7 -> null
      - backup_target                         = "region" -> null
      - backup_window                         = "03:00-04:00" -> null
      - ca_cert_identifier                    = "rds-ca-rsa2048-g1" -> null
      - copy_tags_to_snapshot                 = false -> null
      - customer_owned_ip_enabled             = false -> null
      - database_insights_mode                = "standard" -> null
      - db_name                               = "teleport_backend" -> null
      - db_subnet_group_name                  = "grant-tam-db-subnet-group" -> null
      - dedicated_log_volume                  = false -> null
      - delete_automated_backups              = true -> null
      - deletion_protection                   = false -> null
      - domain_dns_ips                        = [] -> null
      - enabled_cloudwatch_logs_exports       = [] -> null
      - endpoint                              = "grant-tam-pg-1.cgi8j6a0fvrt.us-west-2.rds.amazonaws.com:5432" -> null
      - engine                                = "postgres" -> null
      - engine_lifecycle_support              = "open-source-rds-extended-support" -> null
      - engine_version                        = "17.6" -> null
      - engine_version_actual                 = "17.6" -> null
      - hosted_zone_id                        = "Z1PVIF0B656C1W" -> null
      - iam_database_authentication_enabled   = true -> null
      - id                                    = "db-MYN2RWSKYW7WYAREFOPNOVFBBQ" -> null
      - identifier                            = "grant-tam-pg-1" -> null
      - instance_class                        = "db.t3.medium" -> null
      - iops                                  = 3000 -> null
      - kms_key_id                            = "arn:aws:kms:us-west-2:278576220453:key/d8d1b2e5-bcb8-45ac-b42a-35d6b815107e" -> null
      - latest_restorable_time                = "2026-03-17T05:04:36Z" -> null
      - license_model                         = "postgresql-license" -> null
      - listener_endpoint                     = [] -> null
      - maintenance_window                    = "mon:04:00-mon:05:00" -> null
      - master_user_secret                    = [] -> null
      - max_allocated_storage                 = 100 -> null
      - monitoring_interval                   = 0 -> null
      - multi_az                              = false -> null
      - network_type                          = "IPV4" -> null
      - option_group_name                     = "default:postgres-17" -> null
      - parameter_group_name                  = "grant-tam-pg17" -> null
      - password                              = (sensitive value) -> null
      - performance_insights_enabled          = false -> null
      - performance_insights_retention_period = 0 -> null
      - port                                  = 5432 -> null
      - publicly_accessible                   = false -> null
      - replicas                              = [] -> null
      - resource_id                           = "db-MYN2RWSKYW7WYAREFOPNOVFBBQ" -> null
      - skip_final_snapshot                   = true -> null
      - status                                = "available" -> null
      - storage_encrypted                     = true -> null
      - storage_throughput                    = 125 -> null
      - storage_type                          = "gp3" -> null
      - tags                                  = {
          - "Name"                          = "grant-tam-pg-1"
          - "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        } -> null
      - tags_all                              = {
          - "Name"                          = "grant-tam-pg-1"
          - "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        } -> null
      - username                              = "teleport_admin" -> null
      - vpc_security_group_ids                = [
          - "sg-0e7f881d1bc0dbce3",
        ] -> null
        # (14 unchanged attributes hidden)
    }

  # aws_db_parameter_group.main will be destroyed
  # (because aws_db_parameter_group.main is not in configuration)
  - resource "aws_db_parameter_group" "main" {
      - arn          = "arn:aws:rds:us-west-2:278576220453:pg:grant-tam-pg17" -> null
      - description  = "Parameter group for Teleport PostgreSQL 17" -> null
      - family       = "postgres17" -> null
      - id           = "grant-tam-pg17" -> null
      - name         = "grant-tam-pg17" -> null
      - skip_destroy = false -> null
      - tags         = {
          - "Name"                          = "grant-tam-pg17"
          - "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        } -> null
      - tags_all     = {
          - "Name"                          = "grant-tam-pg17"
          - "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        } -> null
        # (1 unchanged attribute hidden)

      - parameter {
          - apply_method = "pending-reboot" -> null
          - name         = "rds.logical_replication" -> null
          - value        = "1" -> null
        }
    }

  # aws_db_subnet_group.main will be destroyed
  # (because aws_db_subnet_group.main is not in configuration)
  - resource "aws_db_subnet_group" "main" {
      - arn                     = "arn:aws:rds:us-west-2:278576220453:subgrp:grant-tam-db-subnet-group" -> null
      - description             = "Subnet group for Teleport RDS PostgreSQL" -> null
      - id                      = "grant-tam-db-subnet-group" -> null
      - name                    = "grant-tam-db-subnet-group" -> null
      - subnet_ids              = [
          - "subnet-0546824c86a182aba",
          - "subnet-06780303b8ba9d883",
        ] -> null
      - supported_network_types = [
          - "IPV4",
        ] -> null
      - tags                    = {
          - "Name"                          = "grant-tam-db-subnet-group"
          - "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        } -> null
      - tags_all                = {
          - "Name"                          = "grant-tam-db-subnet-group"
          - "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        } -> null
      - vpc_id                  = "vpc-077a2e9746ba3d35f" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy.rds_iam_auth will be destroyed
  # (because aws_iam_role_policy.rds_iam_auth is not in configuration)
  - resource "aws_iam_role_policy" "rds_iam_auth" {
      - id          = "grant-tam-ec2-role:grant-tam-rds-iam-auth-policy" -> null
      - name        = "grant-tam-rds-iam-auth-policy" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "rds-db:connect"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:rds-db:us-west-2:*:dbuser:*/*",
                        ]
                      - Sid      = "RDSConnect"
                    },
                  - {
                      - Action   = [
                          - "rds:DescribeDBInstances",
                          - "rds:ModifyDBInstance",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "RDSDescribe"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "grant-tam-ec2-role" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_instance.master will be updated in-place
  ~ resource "aws_instance" "master" {
        id                                   = "i-0031b7d347bb0cff4"
      ~ public_dns                           = "ec2-44-252-96-5.us-west-2.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "44.252.96.5" -> (known after apply)
        tags                                 = {
            "Name"                          = "grant-tam-master"
            "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        }
      ~ user_data                            = (sensitive value)
        # (38 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_security_group.rds will be destroyed
  # (because aws_security_group.rds is not in configuration)
  - resource "aws_security_group" "rds" {
      - arn                    = "arn:aws:ec2:us-west-2:278576220453:security-group/sg-0e7f881d1bc0dbce3" -> null
      - description            = "Allow PostgreSQL access from Kubernetes nodes" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - id                     = "sg-0e7f881d1bc0dbce3" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "PostgreSQL from cluster nodes"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0e4142be9c6b37261",
                ]
              - self             = false
              - to_port          = 5432
            },
        ] -> null
      - name                   = "grant-tam-rds-SG" -> null
      - owner_id               = "278576220453" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name"                          = "grant-tam-rds-SG"
          - "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        } -> null
      - tags_all               = {
          - "Name"                          = "grant-tam-rds-SG"
          - "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        } -> null
      - vpc_id                 = "vpc-077a2e9746ba3d35f" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_subnet.secondary will be destroyed
  # (because aws_subnet.secondary is not in configuration)
  - resource "aws_subnet" "secondary" {
      - arn                                            = "arn:aws:ec2:us-west-2:278576220453:subnet/subnet-06780303b8ba9d883" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-west-2b" -> null
      - availability_zone_id                           = "usw2-az1" -> null
      - cidr_block                                     = "172.49.21.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-06780303b8ba9d883" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "278576220453" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"                          = "grant-tam-subnet-2"
          - "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        } -> null
      - tags_all                                       = {
          - "Name"                          = "grant-tam-subnet-2"
          - "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        } -> null
      - vpc_id                                         = "vpc-077a2e9746ba3d35f" -> null
        # (4 unchanged attributes hidden)
    }

  # local_sensitive_file.private_key will be created
  + resource "local_sensitive_file" "private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0600"
      + filename             = "./grant-tam-key.pem"
      + id                   = (known after apply)
    }

Plan: 1 to add, 1 to change, 6 to destroy.

Changes to Outputs:
  ~ master_public_ip       = "44.252.96.5" -> (known after apply)
  - rds_address            = "grant-tam-pg-1.cgi8j6a0fvrt.us-west-2.rds.amazonaws.com" -> null
  - rds_endpoint           = "grant-tam-pg-1.cgi8j6a0fvrt.us-west-2.rds.amazonaws.com:5432" -> null
  + sessions_bucket        = "grant-tam-teleport-sessions"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
</details>